["Parker Fink", "What is the following errors is caused by  calculation error?", ["logical", "Arithmatic", "truncation", "semantic"],"1","2"]
["Parker Fink", "Which of the following uses the three basic control structures to form highly structured units of code?", ["structured programming", "circular connector", "modular construction", "loop structure"],"1", "1"]
["Parker Fink", "what type of principle is used for configuring preferences that allow the user to personalise an application", ["CLI", "GUI", "API", "DOS"],"1", "2"]
["Parker Fink", "All computer instructions are based on four basic logic patterns. these patterns are simple sequence, selection, loop, and...", ["trailer", "modular", "top-down", "branch"],"1", "2"]
["Parker Fink", "if the memory speed of the bus is 750MHz, and the CPU is operating at twice the speec of the bus, what is the speed of the processor?", ["375MHz", "750MHz", "1.5GHz", "2GHz"],"1", "3"]
["Parker Fink", "two types of programs that create machine code are the interpreter and the...", ["assembler", "object", "compiler", "source"],"1", "1"]
["Parker Fink", "in the order of calculations in a program", ["addition precedes division", "parenthesis precedes exponentation", "subtraction precedes addition", "multiplication precedes exponentation"],"1", "2"]
["Parker Fink", "when the code below is excecuted, strAdd will be equal to", ["579", "123 + 456", "123456", "strFirst + strSecond"],"", ""]
["Parker Fink", "if a programmer downloads a copy of Microsoft SQL server from a file-sharing server website without paying for it, the programmer has commited an offense called...", ["piracy", "larceny", "felony", "spyware"],"1", "1"]
["Parker Fink", "The Sarbanes-Oxley Act requires monitoring and documentation of transactions. How could a programmer mistakenly set up a program that would cause problems with compliance with SOX", ["create system logs of the transactions taken in the session", "require a user to click three times when they are sure they want to precede", "help a user to request assistance from the system administrators", "utilize system credentials instead of pass-through credentials"],"1", "4"]
["Parker Fink", "The following programming flowchart symbol is a/an...", ["processing", "input/output", "decision", "connector"],"1", "3"]
["Parker Fink", "one of the main goals in analyzing user requirements is to...", ["troubleshoot the problem,", "shutdown and maintain the system", "keep the customer happy", "elicit requirements from a users point of view"],"1", "3"]
["Parker Fink", "if a record has the following field lengths, what is the record length", ["42", "47", "54", "56"],"1", "2"]
["Parker Fink", "The following programming flowchart symbol is a/an...", ["processing", "input/output", "decision", "test"],"1", "2"]
["Parker Fink", "a programmer is starting a new programming project. during what phase of the programming project should the programmer begin with planning for data storage", ["billing", "documentation", "implementation", "test"],"1", "3"]
["Parker Fink", "a progammer needs to manipulate data that consists of a sequence of numbers that must be used as both an individual object and a set of data. what is the best data structure the programmer can use", ["array", "constant", "string", "field"],"1", "1"]
["Parker Fink", "when a programmer is ready to create an excecutable code, what process is used", ["debugging", "editing", "compiling", "dissasembling"],"1", "3"]
["Parker Fink", "the source document and _____ should follow the same order", ["input screen design", "output screen design", "decision- type operator symbols", "processing function symbols"],"1", "1"]
["Parker Fink", "which of the following is a correct name for a variable", ["State_Zipcode", "State+Zipcode", "State Zipcode", "State=Zipcode"],"1", "1"]
["Parker Fink", "which of the following expression is invalid? A=10 + New Data", ["variable 5 is not defined", "data types are mixed", "New Data is not a string", "New Data = 0"],"1", "2"]
["Parker Fink", "an output field has Los Angeles moved to it and when examined contains Los Angeles. This indicates a/an _____ error", ["logical", "arithmatic", "truncation", "semantic"],"1", "3"]
["Parker Fink", "A programmer needs to define the type of value for a variable. what pre-defined set of characteristics for a variable can the programmer choose", ["storage location", "return value", "method modifier", "data type"],"1", "2"]
["Parker Fink", "one example of scripting language is...", ["Perl", "C++", "Fortran", "Beta"],"1", "2"]
["Parker Fink", "which of the following use plain english queries", ["BASIC", "FORTRAN", "SQL", "C++"],"1", "4"]
["Parker Fink", "an example of a loop structure is? ", ["DO UNTIL", "SLELECT IF", "EXCECUTE", "NEXT"],"1", "1"]
["Parker Fink", "compile errors can be caused by ", ["bad syntax", "input data", "insufficient test data", "incorrect user specification"],"1", "1"]
["Parker Fink", "Typically after successful integration testing, a ______ test is performed to compile a fromt to back ececution of the entire application", ["system", "unit", "fuzz", "beta"],"1", "2"]
["Parker Fink", "the implementation phase consists of coding, testing, and...", ["designing", "building prototype programs", "establish requirements", "integration"],"1", "3"]
["Parker Fink", "when TEXT1.VALUE= March 7, TEXT1_LEN= ", ["7", "8", "9", "10"],"1", "4"]
["Parker Fink", "A data element is intended to contain a range from 15 to 30 and after testing it contains 32. what kind of error is this", ["truncation", "rounding", "run time", "boundary"],"1", "4"]
["Parker Fink", "which of the following consists of a sequence of events to follow so they can be repeated.", ["runtime", "test files", "trace route", "script"],"1", "1"]
["Parker Fink", "maintinence refers to changes to a system in operating arising from error corrections, performance improvements, changes in business enviroment and...", ["enhancements in function", "application requirements", "referencing software", "material requirements"],"1", "1"]
["Parker Fink", "one method of ensuring that updates to documentation are efficiently distributed is to", ["send customers printed documentation annually reguardless of whether there have been changes", "make changes in an online help system rather than printed sources", "send fliers containing only the changes rather than new printed volumes", "make changes only on a pre-specific schedule"],"1", "1"]
["Parker Fink", "a programmer has to make programming changes to an existing program. therefore the comments in the existing program must also be updated. the comments are refered to as _____ documentation. ", ["external", "internal", "primary", "secondary"],"1", "4"]
["Parker Fink", "a programmer has decided to create a pop up window that will display a brief description of a control purpose when the mouse hovers over it. this popup is known as a...", ["hyper clip", "too tip", "task bar", "help bar"],"1", "2"]
